GaloisInc/tower/tower-freertos/support/stm32_ivory_init.c
/* This file has been autogenerated by Ivory
 * Compiler version  0.1.0.1
 */
#include "stm32_ivory_init.h"

static void init_clocks();

void Reset_Handler()
{
    init_relocate();
    init_clocks();
    init_libc();
    main();
}

void init_clocks()
{
    /* platformClockConfig: ClockConfig {clockconfig_source = External 24000000, clockconfig_pll = PLLFactor {pll_m = 24, pll_n = 336, pll_p = 2, pll_q = 7}, clockconfig_hclk_divider = 1, clockconfig_pclk1_divider = 4, clockconfig_pclk2_divider = 2}
sysclk: 168000000
hclk:   168000000
pclk1:  42000000
pclk2:  84000000 */
    
    uint32_t n_r0 = ivory_hw_io_read_u32((uint32_t) 1073887232U);
    
    /* reg modify rcc_cr: setBit rcc_cr_hsi_on */
    ivory_hw_io_write_u32((uint32_t) 1073887232U, (uint32_t) (n_r0 |
                                                              (uint32_t) ((uint32_t) 1U <<
                                                                          (uint32_t) 0U)));
    
    uint32_t n_r1 = ivory_hw_io_read_u32((uint32_t) 1073887240U);
    
    /* reg modify rcc_cfgr: setField rcc_cfgr_mco2, setField rcc_cfgr_mco2_pre, setField rcc_cfgr_mco1_pre, clearBit rcc_cfgr_i2ssrc, setField rcc_cfgr_mco1, setField rcc_cfgr_rtcpre, setField rcc_cfgr_ppre2, setField rcc_cfgr_ppre1, setField rcc_cfgr_hpre, setField rcc_cfgr_sws */
    ivory_hw_io_write_u32((uint32_t) 1073887240U,
                          (uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) (n_r1 &
                                                                                                                                                                                                                                                              (uint32_t) ~(uint32_t) ((uint32_t) 3U <<
                                                                                                                                                                                                                                                                                      (uint32_t) 30U)) |
                                                                                                                                                                                                                                                  (uint32_t) ((uint32_t) 0U <<
                                                                                                                                                                                                                                                              (uint32_t) 30U)) &
                                                                                                                                                                                                                                      (uint32_t) ~(uint32_t) ((uint32_t) 7U <<
                                                                                                                                                                                                                                                              (uint32_t) 27U)) |
                                                                                                                                                                                                                          (uint32_t) ((uint32_t) 0U <<
                                                                                                                                                                                                                                      (uint32_t) 27U)) &
                                                                                                                                                                                                              (uint32_t) ~(uint32_t) ((uint32_t) 7U <<
                                                                                                                                                                                                                                      (uint32_t) 24U)) |
                                                                                                                                                                                                  (uint32_t) ((uint32_t) 0U <<
                                                                                                                                                                                                              (uint32_t) 24U)) &
                                                                                                                                                                                      (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                                                                                                                                              (uint32_t) 23U)) &
                                                                                                                                                                          (uint32_t) ~(uint32_t) ((uint32_t) 3U <<
                                                                                                                                                                                                  (uint32_t) 21U)) |
                                                                                                                                                              (uint32_t) ((uint32_t) 0U <<
                                                                                                                                                                          (uint32_t) 21U)) &
                                                                                                                                                  (uint32_t) ~(uint32_t) ((uint32_t) 31U <<
                                                                                                                                                                          (uint32_t) 16U)) |
                                                                                                                                      (uint32_t) ((uint32_t) 0 <<
                                                                                                                                                  (uint32_t) 16U)) &
                                                                                                                          (uint32_t) ~(uint32_t) ((uint32_t) 7U <<
                                                                                                                                                  (uint32_t) 13U)) |
                                                                                                              (uint32_t) ((uint32_t) 0U <<
                                                                                                                          (uint32_t) 13U)) &
                                                                                                  (uint32_t) ~(uint32_t) ((uint32_t) 7U <<
                                                                                                                          (uint32_t) 10U)) |
                                                                                      (uint32_t) ((uint32_t) 0U <<
                                                                                                  (uint32_t) 10U)) &
                                                                          (uint32_t) ~(uint32_t) ((uint32_t) 15U <<
                                                                                                  (uint32_t) 4U)) |
                                                              (uint32_t) ((uint32_t) 0U <<
                                                                          (uint32_t) 4U)) &
                                                  (uint32_t) ~(uint32_t) ((uint32_t) 3U <<
                                                                          (uint32_t) 2U)) |
                                      (uint32_t) ((uint32_t) 0U <<
                                                  (uint32_t) 2U)));
    
    uint32_t n_r2 = ivory_hw_io_read_u32((uint32_t) 1073887232U);
    
