GaloisInc/tower/tower-freertos/support/stm32_ivory_init.c
    /* reg modify rcc_cr: clearBit rcc_cr_hse_on, clearBit rcc_cr_css_on, clearBit rcc_cr_pll_on */
    ivory_hw_io_write_u32((uint32_t) 1073887232U,
                          (uint32_t) ((uint32_t) ((uint32_t) (n_r2 &
                                                              (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                      (uint32_t) 16U)) &
                                                  (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                          (uint32_t) 19U)) &
                                      (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                              (uint32_t) 24U)));
    
    uint32_t n_r3 = ivory_hw_io_read_u32((uint32_t) 1073887236U);
    
    /* reg modify rcc_pllcfgr: setField rcc_pllcfgr_pllq, clearBit rcc_pllcfgr_pllsrc, setField rcc_pllcfgr_pllp, setField rcc_pllcfgr_plln, setField rcc_pllcfgr_pllm */
    ivory_hw_io_write_u32((uint32_t) 1073887236U,
                          (uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) (n_r3 &
                                                                                                                                      (uint32_t) ~(uint32_t) ((uint32_t) 15U <<
                                                                                                                                                              (uint32_t) 24U)) |
                                                                                                                          (uint32_t) ((uint32_t) (uint8_t) ((uint8_t) 2U &
                                                                                                                                                            (uint8_t) 15U) <<
                                                                                                                                      (uint32_t) 24U)) &
                                                                                                              (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                                                                      (uint32_t) 22U)) &
                                                                                                  (uint32_t) ~(uint32_t) ((uint32_t) 3U <<
                                                                                                                          (uint32_t) 16U)) |
                                                                                      (uint32_t) ((uint32_t) 0U <<
                                                                                                  (uint32_t) 16U)) &
                                                                          (uint32_t) ~(uint32_t) ((uint32_t) 511U <<
                                                                                                  (uint32_t) 6U)) |
                                                              (uint32_t) ((uint32_t) (uint16_t) ((uint16_t) 192U &
                                                                                                 (uint16_t) 511U) <<
                                                                          (uint32_t) 6U)) &
                                                  (uint32_t) ~(uint32_t) ((uint32_t) 63U <<
                                                                          (uint32_t) 0U)) |
                                      (uint32_t) ((uint32_t) (uint8_t) ((uint8_t) 16U &
                                                                        (uint8_t) 63U) <<
                                                  (uint32_t) 0U)));
    
    uint32_t n_r4 = ivory_hw_io_read_u32((uint32_t) 1073887232U);
    
    /* reg modify rcc_cr: clearBit rcc_cr_hse_byp */
    ivory_hw_io_write_u32((uint32_t) 1073887232U, (uint32_t) (n_r4 &
                                                              (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                      (uint32_t) 18U)));
    
    uint32_t n_r5 = ivory_hw_io_read_u32((uint32_t) 1073887244U);
    
    /* reg modify rcc_cir: clearBit rcc_cir_plli2s_rdyie, clearBit rcc_cir_pll_rdyie, clearBit rcc_cir_hse_rdyie, clearBit rcc_cir_hsi_rdyie, clearBit rcc_cir_lse_rdyie, clearBit rcc_cir_lsi_rdyie */
    ivory_hw_io_write_u32((uint32_t) 1073887244U,
                          (uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) (n_r5 &
                                                                                                  (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                                                          (uint32_t) 13U)) &
                                                                                      (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                                              (uint32_t) 12U)) &
                                                                          (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                                  (uint32_t) 11U)) &
                                                              (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                                      (uint32_t) 10U)) &
                                                  (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                                          (uint32_t) 9U)) &
                                      (uint32_t) ~(uint32_t) ((uint32_t) 1U <<
                                                              (uint32_t) 8U)));
    
    uint32_t n_r6 = ivory_hw_io_read_u32((uint32_t) 1073887232U);
    
