GaloisInc/tower/tower-freertos/support/stm32_ivory_init.c
            uint32_t n_r18 = ivory_hw_io_read_u32((uint32_t) 1073887232U);
            
            if ((bool) ((bool) ((uint8_t) (uint16_t) ((uint16_t) (uint32_t) ((uint32_t) ((uint32_t) (n_r18 >>
                                                                                                     (uint32_t) 25U) &
                                                                                         (uint32_t) 1U) &
                                                                             (uint32_t) 65535U) &
                                                      (uint16_t) 255U) ==
                                (uint8_t) 0U) ? false : true)) {
                break;
            }
        }
    }
    
    uint32_t n_r19 = ivory_hw_io_read_u32((uint32_t) 1073888256U);
    
    /* reg modify flash_acr: setBit flash_acr_ic_en, setBit flash_acr_dc_en, setField flash_acr_latency */
    ivory_hw_io_write_u32((uint32_t) 1073888256U,
                          (uint32_t) ((uint32_t) ((uint32_t) ((uint32_t) (n_r19 |
                                                                          (uint32_t) ((uint32_t) 1U <<
                                                                                      (uint32_t) 9U)) |
                                                              (uint32_t) ((uint32_t) 1U <<
                                                                          (uint32_t) 10U)) &
                                                  (uint32_t) ~(uint32_t) ((uint32_t) 7U <<
                                                                          (uint32_t) 0U)) |
                                      (uint32_t) ((uint32_t) (uint8_t) ((uint8_t) 5U &
                                                                        (uint8_t) 7U) <<
                                                  (uint32_t) 0U)));
    
    uint32_t n_r20 = ivory_hw_io_read_u32((uint32_t) 1073887240U);
    
    /* reg modify rcc_cfgr: setField rcc_cfgr_sw */
    ivory_hw_io_write_u32((uint32_t) 1073887240U,
                          (uint32_t) ((uint32_t) (n_r20 &
                                                  (uint32_t) ~(uint32_t) ((uint32_t) 3U <<
                                                                          (uint32_t) 0U)) |
                                      (uint32_t) ((uint32_t) (uint8_t) ((uint8_t) 2U <<
                                                                        (uint8_t) 0U) <<
                                                  (uint32_t) 0U)));
    {
        int forever_loop __attribute__((unused));
        
        for (forever_loop = 0; FOREVER; FOREVER_INC) {
            /* reg get rcc_cfgr:  */
            
            uint32_t n_r21 = ivory_hw_io_read_u32((uint32_t) 1073887240U);
            
            if ((bool) ((uint8_t) (uint16_t) ((uint16_t) (uint32_t) ((uint32_t) ((uint32_t) (n_r21 >>
                                                                                             (uint32_t) 2U) &
                                                                                 (uint32_t) 3U) &
                                                                     (uint32_t) 65535U) &
                                              (uint16_t) 255U) ==
                        (uint8_t) ((uint8_t) 2U << (uint8_t) 0U))) {
                break;
            }
        }
    }
}